MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_usb.h
/* USB_TXTYPE Bits */
/* USB_TXTYPE[TEP] Bits */
#define USB_TXTYPE_TEP_OFS                       (0)                             /* !< TEP Offset */
#define USB_TXTYPE_TEP_MASK                      ((uint8_t)0x0000000FU)          /* !< Target Endpoint Number. Software
                                                                                    must configure this value to the
                                                                                    endpoint number contained in the
                                                                                    transmit endpoint descriptor returned
                                                                                    to the USB controller during Device
                                                                                    enumeration. */
/* USB_TXTYPE[PROTO] Bits */
#define USB_TXTYPE_PROTO_OFS                     (4)                             /* !< PROTO Offset */
#define USB_TXTYPE_PROTO_MASK                    ((uint8_t)0x00000030U)          /* !< Protocol. Software must configure
                                                                                    this bit field to select the required
                                                                                    protocol for the transmit endpoint: */
#define USB_TXTYPE_PROTO_CTRL                    ((uint8_t)0x00000000U)          /* !< Control */
#define USB_TXTYPE_PROTO_ISO                     ((uint8_t)0x00000010U)          /* !< isochronous */
#define USB_TXTYPE_PROTO_BULK                    ((uint8_t)0x00000020U)          /* !< Bulk */
#define USB_TXTYPE_PROTO_INT                     ((uint8_t)0x00000030U)          /* !< Interrupt */
/* USB_TXTYPE[SPEED] Bits */
#define USB_TXTYPE_SPEED_OFS                     (6)                             /* !< SPEED Offset */
#define USB_TXTYPE_SPEED_MASK                    ((uint8_t)0x000000C0U)          /* !< Operating Speed. This bit field
                                                                                    specifies the operating speed of the
                                                                                    target Device: */
#define USB_TXTYPE_SPEED_DEFAULT                 ((uint8_t)0x00000000U)          /* !< Default. The target is assumed to
                                                                                    be using the same connection speed as
                                                                                    the USB controller. */
#define USB_TXTYPE_SPEED_FULL                    ((uint8_t)0x00000080U)          /* !< Full speed */
#define USB_TXTYPE_SPEED_LOW                     ((uint8_t)0x000000C0U)          /* !< Low speed */

/* USB_TXINTERVAL Bits */
/* USB_TXINTERVAL[TXPOLLNAKLMT] Bits */
#define USB_TXINTERVAL_TXPOLLNAKLMT_OFS          (0)                             /* !< TXPOLLNAKLMT Offset */
#define USB_TXINTERVAL_TXPOLLNAKLMT_MASK         ((uint8_t)0x000000FFU)          /* !< TX Polling / NAK Limit The polling
                                                                                    interval for interrupt/isochronous
                                                                                    transfers; the NAK limit for bulk
                                                                                    transfers. */

/* USB_RXTYPE Bits */
/* USB_RXTYPE[TEP] Bits */
#define USB_RXTYPE_TEP_OFS                       (0)                             /* !< TEP Offset */
#define USB_RXTYPE_TEP_MASK                      ((uint8_t)0x0000000FU)          /* !< Target Endpoint Number. Software
                                                                                    must configure this value to the
                                                                                    endpoint number contained in the
                                                                                    transmit endpoint descriptor returned
                                                                                    to the USB controller during Device
                                                                                    enumeration. */
/* USB_RXTYPE[PROTO] Bits */
#define USB_RXTYPE_PROTO_OFS                     (4)                             /* !< PROTO Offset */
#define USB_RXTYPE_PROTO_MASK                    ((uint8_t)0x00000030U)          /* !< Protocol. Software must configure
                                                                                    this bit field to select the required
                                                                                    protocol for the transmit endpoint: */
#define USB_RXTYPE_PROTO_CTRL                    ((uint8_t)0x00000000U)          /* !< Control */
#define USB_RXTYPE_PROTO_ISO                     ((uint8_t)0x00000010U)          /* !< isochronous */
#define USB_RXTYPE_PROTO_BULK                    ((uint8_t)0x00000020U)          /* !< Bulk */
#define USB_RXTYPE_PROTO_INT                     ((uint8_t)0x00000030U)          /* !< Interrupt */
/* USB_RXTYPE[SPEED] Bits */
#define USB_RXTYPE_SPEED_OFS                     (6)                             /* !< SPEED Offset */
#define USB_RXTYPE_SPEED_MASK                    ((uint8_t)0x000000C0U)          /* !< Operating Speed.  #br#This bit
                                                                                    field specifies the operating speed
                                                                                    of the target Device: */
#define USB_RXTYPE_SPEED_DEFAULT                 ((uint8_t)0x00000000U)          /* !< Default. The target is assumed to
                                                                                    be using the same connection speed as
                                                                                    the USB controller. */
#define USB_RXTYPE_SPEED_FULL                    ((uint8_t)0x00000080U)          /* !< Full speed */
#define USB_RXTYPE_SPEED_LOW                     ((uint8_t)0x000000C0U)          /* !< Low speed */

/* USB_RXINTERVAL Bits */
/* USB_RXINTERVAL[RXPOLLNAKLMT] Bits */
#define USB_RXINTERVAL_RXPOLLNAKLMT_OFS          (0)                             /* !< RXPOLLNAKLMT Offset */
#define USB_RXINTERVAL_RXPOLLNAKLMT_MASK         ((uint8_t)0x000000FFU)          /* !< RX Polling / NAK Limit The polling
                                                                                    interval for interrupt/isochronous
                                                                                    transfers; the NAK limit for bulk
                                                                                    transfers. */

/* USB_FIFOSZ Bits */
/* USB_FIFOSZ[TXSIZE] Bits */
#define USB_FIFOSZ_TXSIZE_OFS                    (0)                             /* !< TXSIZE Offset */
#define USB_FIFOSZ_TXSIZE_MASK                   ((uint8_t)0x0000000FU)          /* !< Returns the configured size of the
                                                                                    TX FIFO */
#define USB_FIFOSZ_TXSIZE_BYTES_8                ((uint8_t)0x00000000U)          /* !< FIFO size 8-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_16               ((uint8_t)0x00000001U)          /* !< FIFO size 16-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_32               ((uint8_t)0x00000002U)          /* !< FIFO size 32-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_64               ((uint8_t)0x00000003U)          /* !< FIFO size 64-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_128              ((uint8_t)0x00000004U)          /* !< FIFO size 128-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_256              ((uint8_t)0x00000005U)          /* !< FIFO size 256-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_512              ((uint8_t)0x00000006U)          /* !< FIFO size 512-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_1024             ((uint8_t)0x00000007U)          /* !< FIFO size 1024-byte */
#define USB_FIFOSZ_TXSIZE_BYTES_2048             ((uint8_t)0x00000008U)          /* !< FIFO size 2048-byte */
/* USB_FIFOSZ[RXSIZE] Bits */
#define USB_FIFOSZ_RXSIZE_OFS                    (4)                             /* !< RXSIZE Offset */
#define USB_FIFOSZ_RXSIZE_MASK                   ((uint8_t)0x000000F0U)          /* !< Returns the configured size of the
                                                                                    RX FIFO */
#define USB_FIFOSZ_RXSIZE_BYTES_8                ((uint8_t)0x00000000U)          /* !< FIFO size 8-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_16               ((uint8_t)0x00000010U)          /* !< FIFO size 16-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_32               ((uint8_t)0x00000020U)          /* !< FIFO size 32-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_64               ((uint8_t)0x00000030U)          /* !< FIFO size 64-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_128              ((uint8_t)0x00000040U)          /* !< FIFO size 128-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_256              ((uint8_t)0x00000050U)          /* !< FIFO size 256-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_512              ((uint8_t)0x00000060U)          /* !< FIFO size 512-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_1024             ((uint8_t)0x00000070U)          /* !< FIFO size 1024-byte */
#define USB_FIFOSZ_RXSIZE_BYTES_2048             ((uint8_t)0x00000080U)          /* !< FIFO size 2048-byte */

/* USB_TXFUNCADDR Bits */
/* USB_TXFUNCADDR[ADDR] Bits */
#define USB_TXFUNCADDR_ADDR_OFS                  (0)                             /* !< ADDR Offset */
#define USB_TXFUNCADDR_ADDR_MASK                 ((uint8_t)0x0000007FU)          /* !< Device Address specifies the USB
                                                                                    bus address for the target Device. */

