MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_usb.h
/* USB_USBIE Bits */
/* USB_USBIE[SUSPEND] Bits */
#define USB_USBIE_SUSPEND_OFS                    (0)                             /* !< SUSPEND Offset */
#define USB_USBIE_SUSPEND_MASK                   ((uint8_t)0x00000001U)          /* !< Interrupt enable for SUSPEND
                                                                                    signaling detected. Note: Only valid
                                                                                    in Peripheral mode. */
#define USB_USBIE_SUSPEND_DISABLE                ((uint8_t)0x00000000U)          /* !< The SUSPEND interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USB_USBIE_SUSPEND_ENABLE                 ((uint8_t)0x00000001U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the DISCON
                                                                                    bit in the USBIS register is set. */
/* USB_USBIE[RESUME] Bits */
#define USB_USBIE_RESUME_OFS                     (1)                             /* !< RESUME Offset */
#define USB_USBIE_RESUME_MASK                    ((uint8_t)0x00000002U)          /* !< Interrupt enable for RESUME
                                                                                    signaling detected. */
#define USB_USBIE_RESUME_DISABLE                 ((uint8_t)0x00000000U)          /* !< The RESUME interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USB_USBIE_RESUME_ENABLE                  ((uint8_t)0x00000002U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the RESUME
                                                                                    bit in the USBIS register is set. */
/* USB_USBIE[RESETBABBLE] Bits */
#define USB_USBIE_RESETBABBLE_OFS                (2)                             /* !< RESETBABBLE Offset */
#define USB_USBIE_RESETBABBLE_MASK               ((uint8_t)0x00000004U)          /* !< Interrupt enable for RESET/BABBLE
                                                                                    signaling detected. */
#define USB_USBIE_RESETBABBLE_DSIABLE            ((uint8_t)0x00000000U)          /* !< The RESET interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USB_USBIE_RESETBABBLE_ENABLE             ((uint8_t)0x00000004U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the RESET
                                                                                    bit in the USBIS register is set. */
/* USB_USBIE[SOF] Bits */
#define USB_USBIE_SOF_OFS                        (3)                             /* !< SOF Offset */
#define USB_USBIE_SOF_MASK                       ((uint8_t)0x00000008U)          /* !< Interrupt enable for Start of
                                                                                    frame. */
#define USB_USBIE_SOF_DISABLE                    ((uint8_t)0x00000000U)          /* !< The SOF interrupt is suppressed and
                                                                                    not sent to the interrupt controller. */
#define USB_USBIE_SOF_ENABLE                     ((uint8_t)0x00000008U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the SOF bit
                                                                                    in the USBIS register is set. */
/* USB_USBIE[CONN] Bits */
#define USB_USBIE_CONN_OFS                       (4)                             /* !< CONN Offset */
#define USB_USBIE_CONN_MASK                      ((uint8_t)0x00000010U)          /* !< Interrupt enable for connect
                                                                                    detected. Note: Only valid in Host
                                                                                    mode. Valid at all transaction
                                                                                    speeds. */
#define USB_USBIE_CONN_DISABLE                   ((uint8_t)0x00000000U)          /* !< The CONN interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USB_USBIE_CONN_ENABLE                    ((uint8_t)0x00000010U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the CONN
                                                                                    bit in the USBIS register is set. */
/* USB_USBIE[DISCON] Bits */
#define USB_USBIE_DISCON_OFS                     (5)                             /* !< DISCON Offset */
#define USB_USBIE_DISCON_MASK                    ((uint8_t)0x00000020U)          /* !< Interrupt enable for session
                                                                                    disconnect. */
#define USB_USBIE_DISCON_DISABLE                 ((uint8_t)0x00000000U)          /* !< The DISCON interrupt is suppressed
                                                                                    and not sent to the interrupt
                                                                                    controller. */
#define USB_USBIE_DISCON_ENABLE                  ((uint8_t)0x00000020U)          /* !< An interrupt is sent to the
                                                                                    interrupt controller when the DISCON
                                                                                    bit in the USBIS register is set. */

/* USB_FRAME Bits */
/* USB_FRAME[FRAME] Bits */
#define USB_FRAME_FRAME_OFS                      (0)                             /* !< FRAME Offset */
#define USB_FRAME_FRAME_MASK                     ((uint16_t)0x000007FFU)         /* !< Frame Number */

/* USB_EPINDEX Bits */
/* USB_EPINDEX[EPIDX] Bits */
#define USB_EPINDEX_EPIDX_OFS                    (0)                             /* !< EPIDX Offset */
#define USB_EPINDEX_EPIDX_MASK                   ((uint8_t)0x0000000FU)          /* !< Endpoint Index.  #br#This bit field
                                                                                    configures which endpoint is accessed
                                                                                    when reading or writing to one of the
                                                                                    USB controller's indexed registers. A
                                                                                    value of 0x0 corresponds to Endpoint
                                                                                    0 and a value of 0xF corresponds to
                                                                                    Endpoint 15. */
#define USB_EPINDEX_EPIDX_EP0                    ((uint8_t)0x00000000U)          /* !< Select EP0 as indexed register */
#define USB_EPINDEX_EPIDX_EP1                    ((uint8_t)0x00000001U)          /* !< Select EP1 as indexed register */
#define USB_EPINDEX_EPIDX_EP2                    ((uint8_t)0x00000002U)          /* !< Select EP2 as indexed register */
#define USB_EPINDEX_EPIDX_EP3                    ((uint8_t)0x00000003U)          /* !< Select EP3 as indexed register */
#define USB_EPINDEX_EPIDX_EP4                    ((uint8_t)0x00000004U)          /* !< Select EP4 as indexed register */
#define USB_EPINDEX_EPIDX_EP5                    ((uint8_t)0x00000005U)          /* !< Select EP5 as indexed register */
#define USB_EPINDEX_EPIDX_EP6                    ((uint8_t)0x00000006U)          /* !< Select EP6 as indexed register */
#define USB_EPINDEX_EPIDX_EP7                    ((uint8_t)0x00000007U)          /* !< Select EP7 as indexed register */

/* USB_TESTMODE Bits */
/* USB_TESTMODE[FORCEFS] Bits */
#define USB_TESTMODE_FORCEFS_OFS                 (5)                             /* !< FORCEFS Offset */
#define USB_TESTMODE_FORCEFS_MASK                ((uint8_t)0x00000020U)          /* !< Force Full Speed Upon Reset. The
                                                                                    CPU sets this bit either in
                                                                                    conjunction with bit 7 (FORCEH) or to
                                                                                    force the USB controller into
                                                                                    Full-speed mode when it receives a
                                                                                    USB reset. */
#define USB_TESTMODE_FORCEFS_LOW                 ((uint8_t)0x00000000U)          /* !< The USB controller operates at Low
                                                                                    Speed. */
#define USB_TESTMODE_FORCEFS_FULL                ((uint8_t)0x00000020U)          /* !< Forces the USB controller into
                                                                                    Full-Speed mode upon receiving a USB
                                                                                    RESET. */
/* USB_TESTMODE[FIFOACC] Bits */
#define USB_TESTMODE_FIFOACC_OFS                 (6)                             /* !< FIFOACC Offset */
#define USB_TESTMODE_FIFOACC_MASK                ((uint8_t)0x00000040U)          /* !< FIFO Access. The CPU sets this bit
                                                                                    to transfer the packet in the
                                                                                    Endpoint 0 TX FIFO to the Endpoint 0
                                                                                    Rx FIFO.  Note: It is cleared
                                                                                    automatically. */
#define USB_TESTMODE_FIFOACC_NO_EFFECT           ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_TESTMODE_FIFOACC_EFFECT              ((uint8_t)0x00000040U)          /* !< Transfers the packet in the
                                                                                    endpoint 0 transmit FIFO to the
                                                                                    endpoint 0 receive FIFO. */
/* USB_TESTMODE[FORCEH] Bits */
#define USB_TESTMODE_FORCEH_OFS                  (7)                             /* !< FORCEH Offset */
#define USB_TESTMODE_FORCEH_MASK                 ((uint8_t)0x00000080U)          /* !< Force Host Mode. The CPU sets this
                                                                                    bit to instruct the core to enter
                                                                                    Host mode when the Session bit is
                                                                                    set, regardless of whether it is
                                                                                    connected to any peripheral. The
                                                                                    state of the CID input,
                                                                                    HostDisconnect and LineState signals
                                                                                    are ignored. The core will then
                                                                                    remain in Host mode until the Session
                                                                                    bit is cleared, even if a device is
                                                                                    disconnected, and if the Force_Host
                                                                                    bit remains set, will re-enter Host
                                                                                    mode the next time the Session bit is
                                                                                    set. While in this mode, status of
                                                                                    the bus connection may be read using
                                                                                    the DEV bit of the USBDEVCTL
                                                                                    register. The operating speed is
                                                                                    determined from the FORCEFS bit. */
#define USB_TESTMODE_FORCEH_NO_EFFECT            ((uint8_t)0x00000000U)          /* !< No effect */
#define USB_TESTMODE_FORCEH_EFFECT               ((uint8_t)0x00000080U)          /* !< Forces the USB controller to enter
                                                                                    Host mode when the SESSION bit is
                                                                                    set, regardless ofwhether the USB
                                                                                    controller is connected to any
                                                                                    peripheral. The state of the USB0DP
                                                                                    and USB0DM signals is ignored. The
                                                                                    USB controller then remains in Host
                                                                                    mode until the SESSION #br#bit is
                                                                                    cleared, even if a Device is
                                                                                    disconnected. If the FORCEH bit
                                                                                    remains set, the USB controller
                                                                                    re-enters Host mode the next time the
                                                                                    SESSION bit is set. */

/* USB_IDXTXMAXP Bits */
/* USB_IDXTXMAXP[DATA] Bits */
#define USB_IDXTXMAXP_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXTXMAXP_DATA_MASK                  ((uint16_t)0x0000FFFFU)         /* !< Control / Status register data. */

/* USB_IDXTXCSRL Bits */
/* USB_IDXTXCSRL[DATA] Bits */
#define USB_IDXTXCSRL_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXTXCSRL_DATA_MASK                  ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_IDXTXCSRH Bits */
/* USB_IDXTXCSRH[DATA] Bits */
#define USB_IDXTXCSRH_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXTXCSRH_DATA_MASK                  ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_IDXRXMAXP Bits */
/* USB_IDXRXMAXP[DATA] Bits */
#define USB_IDXRXMAXP_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXRXMAXP_DATA_MASK                  ((uint16_t)0x0000FFFFU)         /* !< Control / Status register data. */

/* USB_IDXRXCSRL Bits */
/* USB_IDXRXCSRL[DATA] Bits */
#define USB_IDXRXCSRL_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXRXCSRL_DATA_MASK                  ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_IDXRXCSRH Bits */
/* USB_IDXRXCSRH[DATA] Bits */
#define USB_IDXRXCSRH_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXRXCSRH_DATA_MASK                  ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_IDXRXCOUNT Bits */
/* USB_IDXRXCOUNT[DATA] Bits */
#define USB_IDXRXCOUNT_DATA_OFS                  (0)                             /* !< DATA Offset */
#define USB_IDXRXCOUNT_DATA_MASK                 ((uint16_t)0x0000FFFFU)         /* !< Control / Status register data. */

/* USB_IDXTXTYPE Bits */
/* USB_IDXTXTYPE[DATA] Bits */
#define USB_IDXTXTYPE_DATA_OFS                   (0)                             /* !< DATA Offset */
#define USB_IDXTXTYPE_DATA_MASK                  ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

/* USB_IDXTXINTERVAL Bits */
/* USB_IDXTXINTERVAL[DATA] Bits */
#define USB_IDXTXINTERVAL_DATA_OFS               (0)                             /* !< DATA Offset */
#define USB_IDXTXINTERVAL_DATA_MASK              ((uint8_t)0x000000FFU)          /* !< Control / Status register data. */

